{
  "pedestrian": "<Pedestrian>\nDescription: A single person walking on foot viewed from above. Appears as a slender upright figure with a small head–shoulder blob; often near sidewalks, crossings, or plaza edges; not connected to any vehicle. Common confusions: people (crowd), bicycle/motor riders.",
  "people": "<People>\nDescription: A group or one person not clearly walking (standing, sitting, or crowd). Seen as irregular clusters of small human shapes; individuals may be hard to separate. Not mounted on vehicles. Common confusions: pedestrian (single walker), riders on bicycles/motorcycles.",
  "bicycle": "<Bicycle>\nDescription: Two‑wheel human‑powered vehicle. From a drone view it looks like a thin elongated frame with two circular wheels; usually with a rider leaning forward; slower than motor. Common confusions: motor (scooter/motorcycle).",
  "car": "<Car>\nDescription: Standard passenger vehicle with four wheels and a closed body. Top‑down shape is a compact rectangle with visible roof/windshield; smaller than van, much smaller than bus or truck. Common confusions: van (taller/boxier), taxi (still a car).",
  "van": "<Van>\nDescription: Mid‑size, box‑shaped vehicle with a higher roof than a car. Rectangular footprint with blunt nose; longer and taller than cars but shorter than trucks; often used for delivery or people moving. Common confusions: car (lower profile), small truck.",
  "truck": "<Truck>\nDescription: Large cargo vehicle. From above it has a long rectangular body and often a separate cab; cargo bed/box is prominent; occupies multiple lane widths in length. Common confusions: bus (many windows, passenger doors), large van.",
  "tricycle": "<Tricycle>\nDescription: Three‑wheeled vehicle without a canopy. Narrow front or rear single wheel with two wheels on the other axle; small cargo bed or open seat visible from above. Common confusions: awning‑tricycle (has roof), motor (two wheels).",
  "awning-tricycle": "<Awning Tricycle>\nDescription: Three‑wheeled vehicle with a visible canopy/roof (motor‑rickshaw/tuk‑tuk style). Top‑down cue is a small covered cabin with three wheels and open sides. Common confusions: tricycle (no canopy), very small van.",
  "bus": "<Bus>\nDescription: Long passenger vehicle with many side windows. From above it forms an elongated rectangle significantly longer than cars; doors near the middle or front; often on main roads or at stations. Common confusions: long truck (cargo box, fewer windows).",
  "motor": "<Motorcycle/Scooter>\nDescription: Two‑wheel motorized vehicle (motorbike or scooter). Very thin elongated shape; rider usually visible; faster than bicycles and often near lane edges. Common confusions: bicycle (no engine bulk, thinner wheels)."
}
