{
    "MVTec": {
        "zipper": {
            "combined": "<Zipper Defects>\n Description: The zippers show various defects affecting functionality and appearance. Common issues include:\n - Broken or split teeth: Missing or misaligned teeth, often at the center or bottom, disrupting interlocking and impairing function.\n - Frayed fabric borders: Frayed or torn edges indicate possible material degradation and could weaken attachment.\n - Compressed teeth: Some teeth are squeezed or misaligned, hindering smooth operation.\n - Interior fabric anomalies: Pulled threads or snags affect appearance and function.",
            "fabric_interior": "<Fabric Texture Disruption>\n Description: Localized irregularities, like dark spots or disrupted weave near the zipper, suggest potential wear or manufacturing flaws. These inconsistencies may impact both appearance and structural integrity.",
            "broken_teeth": "<Broken Teeth>\n Description: Missing or damaged teeth create visible gaps in the interlocking sequence, often near the center or top, affecting both functionality and appearance.",
            "split_teeth": "<Split Teeth>\n Description: Misalignment among teeth, usually at the top or bottom, leads to visible gaps in the interlocking sequence, impeding secure closure.",
            "squeezed_teeth": "<Squeezed Teeth>\n Description: Compressed teeth appear pinched and misaligned, disrupting uniform spacing and potentially causing the zipper to stick during use.",
            "rough": "<Zipper Teeth Damage>\n Description: Rough, broken, or misaligned teeth, often around the center, hinder smooth operation, making the zipper likely to snag or stick.",
            "fabric_border": "<Fabric Border Fraying>\n Description: Frayed edges with loose threads, found at various locations, compromise the fabric's structural integrity and appearance."
        },
        "cable": {
            "cable_swap": "<Cable Swap and Missing Wire>\n Description: \"Cable swap\" is marked by incorrect positioning of insulated conductors, leading to color mismatches. Visual indicators include differing insulation colors that deviate from standard configurations. \"Missing wire\" is identified by gaps in the conductor core where metallic strands are missing, reducing electrical integrity and performance.",
            "cut_inner_insulation": "<Inner Insulation Cut>\n Description: Cuts or damage to the inner insulation expose metallic conductors, often seen on blue, green, or brown insulated wires. Key features include irregular edges and visible conductor exposure, posing risks of short circuits.",
            "combined": "<Cable Defects>\n Description: Key defects in the cable batch include:\n 1. **Missing Components**: Gaps where conductors are absent, impacting functionality.\n 2. **Cut or Damaged Insulation**: Exposed internal conductors increase short circuit risk.\n 3. **Deformed Conductors**: Bent wires disrupt normal copper strand arrangement.\n 4. **Cable Swaps or Misplacements**: Incorrect color order creates identification issues, risking operational confusion.",
            "missing_wire": "<Missing Wire>\n Description: Characterized by missing metallic strands in conductor cores, creating visible voids that reduce current-carrying capacity and increase failure risks.",
            "poke_insulation": "<Poke Insulation & Missing Wire>\n Description: Poke Insulation:\n- Punctures or indentations in insulation disrupt its smooth surface, commonly seen in green/yellow, blue, or brown conductors.\nMissing Wire:\n- Gaps within wire bundles reduce structural integrity and electrical performance.",
            "missing_cable": "<Missing Cable>\n Description: Absence of one or more conductive cores results in clear voids in the cable cross-section, compromising electrical continuity and performance.",
            "bent_wire": "<Wire Misalignment and Deformation>\n Description: Visible bending and misalignment disrupt the arrangement, with wires splaying outward or missing, reducing density and symmetry, and impacting functionality.",
            "cut_outer_insulation": "<Outer Insulation Cut and Missing Wires>\n Description: Cut or tear in the outer insulation exposes inner layers, often showing irregular or frayed edges. Missing conductive strands further indicate defects, affecting cable performance and safety."
        },
        "toothbrush": {
            "defective": "<Bristle Alignment and Contamination Defects>\n Description: Toothbrush defects include:\n - **Missing Bristles**: Noticeable gaps disrupt the uniform bristle pattern, reducing brushing effectiveness.\n - **Misaligned or Disordered Bristles**: Clusters of bristles are messy or protruding, impacting both aesthetics and function.\n - **Contamination**: Discoloration or foreign material, appearing as darker patches or spots, raises hygiene concerns.\n These defects affect the toothbrush's visual appeal and performance, suggesting quality control issues."
        },
        "grid": {
            "broken": "<Broken Grid>\n Description: Visible gaps or breaks in the woven or mesh grid pattern, often central, with jagged edges and missing strands. This disrupts the uniform structure and affects the grid's integrity and appearance.",
            "thread": "<Threading Anomaly>\n Description: Irregularities like misaligned, frayed, or broken fibers in the grid, appearing as dark or thickened areas that disturb the grid's uniformity, potentially impacting aesthetics and structure.",
            "metal_contamination": "<Metal Contamination>\n Description: Dark or metallic foreign material disrupting the grid pattern, often with jagged edges and located in prominent areas. This contrasts with the grid's uniform design, affecting both texture and structural integrity.",
            "bent": "<Bent Grid Anomaly>\n Description: Distorted or misshapen sections in the grid pattern, often central, with bent or misaligned threads, creating visible gaps and loss of uniformity, impacting both aesthetics and functionality.",
            "glue": "<Foreign Material Anomaly>\n Description: Irregular accumulation of material (e.g., adhesive) interrupting the grid's pattern, characterized by distinct outlines and contrasting texture, which can disrupt both appearance and structural consistency."
        },
        "transistor": {
            "cut_lead": "<Cut Lead>\n Description: Metal leads on the transistor appear truncated or shorter, with irregular ends, affecting electrical connectivity. Typically seen at bottom left, center, or right, this defect compromises assembly and performance.",
            "bent_lead": "<Bent Lead>\n Description: One or more leads of the transistor are visibly bent outwards, disrupting alignment and creating abnormal angles. Most often observed at the bottom leads, this affects both appearance and functionality in circuit applications.",
            "damaged_case": "<Damaged Case>\n Description: Physical damage on the transistor's casing, such as chipping or deformation, appears on the top or center areas, resulting in a rough texture that contrasts with the intact casing, potentially affecting performance.",
            "misplaced": "<Transistor Misalignment>\n Description: Misaligned legs or shifted central leg disrupt the uniform placement of the transistor on the mounting surface. Misalignment or missing transistors may impact circuit connectivity and functionality."
        },
        "pill": {
            "contamination": "<Contamination and Structural Defects>\n Description: Pills show irregular discolorations, protrusions, and uneven textures, often near the center or imprinted letters, indicating contamination or material inconsistencies. Structural defects such as cracks, scratches, or chips compromise the pill's integrity and suggest potential quality control issues.",
            "combined": "<Pill Surface Defects>\n Description: Oval-shaped pills display structural and visual anomalies, including cracks on edges, flawed letter imprints (\"FF\" or \"FI\"), and scratches. Discoloration or contamination appears as yellow or reddish-brown spots, deviating from the normal speckled pattern, affecting visual integrity and structural quality.",
            "scratch": "<Surface Scratch or Abrasion>\n Description: Scratches on pill surfaces disrupt the smoothness, appearing as thin, irregular lines typically lighter in color. Located near center-right, center-left, or embossed letters, these abrasions mark the pills as anomalies and impact structural integrity.",
            "faulty_imprint": "<Faulty Imprint>\n Description: The imprint of letters \"F\" or \"FF\" on oval pills appears faded, smudged, or incomplete, primarily affecting the center area. This irregularity impacts clarity, legibility, and product identification, crucial for quality control.",
            "crack": "<Crack and Contamination>\n Description: Noticeable cracks on various parts of the pill surface disrupt structural integrity, often accompanied by minor contamination such as spots or discolorations. These defects suggest physical damage and quality concerns.",
            "color": "<Color Anomalies in Pills>\n Description: Irregular colorations appear on the pill's white or off-white base with red speckles. Anomalies include red, yellow, blue, or reddish-brown spots, typically near the center or edges, indicating potential contamination or structural issues that disrupt the pill's appearance."
        },
        "metal_nut": {
            "scratch": "<Scratch Defect>\n Description: Linear markings on the metal nut surface, lighter in color, indicating surface abrasion. These scratches, often near the center and extending to edges, disrupt the smooth texture and may impact the aesthetic and structural integrity of the nut.",
            "bent": "<Metal Nut Deformation and Surface Defects>\n Description: Bending deformities in the hexagonal shape create irregularities, often with inward or outward curves disrupting symmetry. Surface scratches also appear as linear marks, indicating potential weaknesses, affecting both functionality and aesthetic quality.",
            "color": "<Color and Texture Defects>\n Description: Discoloration appears as darker patches or smears, contrasting with the metallic surface, in shades like blue, red, or pink. Texture disruptions include darker scratches that suggest material removal, impacting the nut's appearance and potentially its structural integrity."
        },
        "tile": {
            "gray_stroke": "<Gray Stroke Defect>\n Description: An irregular gray area, darker than the tile's speckled pattern, often found near the center or edges. The uneven edges and concentrated color contrast with the surrounding pattern, suggesting issues in glazing or foreign material presence.",
            "glue_strip": "<Glue Strip Defect>\n Description: A translucent strip with jagged edges disrupting the tile's pattern, lighter in color and glossy compared to the textured finish. Typically near the center or sides, this defect may stem from manufacturing or handling issues, affecting the aesthetic quality.",
            "oil": "<Color Stain or Contamination>\n Description: An oily, yellowish-brown stain with irregular edges on the tile's surface, disrupting the speckled pattern. Blending slightly into the background but standing out due to its color, this stain suggests potential contamination or manufacturing error.",
            "crack": "<Crack in Tile>\n Description: Prominent, jagged cracks with branching patterns (Y or T-shaped) run through the tile, contrasting with the speckled design. Often near the center or edges, these cracks affect both structural integrity and visual appeal.",
            "rough": "<Surface Texture Anomaly>\n Description: Rough, uneven areas with undefined edges on the tile, differing in color or sheen from the smooth speckled surface. Often located at the center or corners, these textured anomalies disrupt the tile's aesthetic and may impact quality."
        },
        "capsule": {
            "poke": "<Poke or Indentation Defect>\n Description: A small indentation or puncture on the capsule's surface, appearing as a circular or irregular white area that stands out against the smooth exterior. Commonly found near the center or edges, this defect may affect the capsule's integrity.",
            "scratch": "<Scratch Defect>\n Description: Fine, linear scratches on the capsule's surface, typically lighter in color and located around the center-right. These markings disrupt the uniform texture, potentially from abrasion or mishandling, affecting appearance and perceived integrity.",
            "squeeze": "<Capsule Deformation (Squeeze)>\n Description: Visible inward dents or compressions on the two-toned capsule, often where colors meet. These distortions create a wavy texture, impacting the capsule's uniformity and potentially affecting its seal and dosage accuracy.",
            "faulty_imprint": "<Faulty Imprint>\n Description: Incomplete or blurred imprints of numbers or text, commonly in the center-right section on the colored half of the capsule. This defect compromises legibility, affecting product identification and quality perception.",
            "crack": "<Crack on Capsule>\n Description: A crack or fissure often located at the junction of two colors, characterized by a jagged line disrupting the smooth surface. This defect may extend across one or both halves, potentially compromising the capsule's structural integrity."
        },
        "hazelnut": {
            "print": "<Print Defect on Hazelnut Shell>\n Description: Irregular white markings or blemishes on the brown shell, resembling printed text, disrupt the natural smooth appearance. These markings are usually near the center, noticeable against the glossy shell, affecting the hazelnut's aesthetic quality.",
            "hole": "<Hazelnut Shell Hole>\n Description: An irregular hole located at or near the center of the shell, often with jagged edges, penetrates the surface, compromising structural integrity and potentially allowing contamination. Surrounding cracks or discoloration may indicate additional damage.",
            "crack": "<Hazelnut Shell Crack>\n Description: Jagged, irregular cracks in the shell, exposing the inner kernel. Found around various areas like the center or tip, these cracks appear as dark lines against the brown shell and affect the nut's quality and freshness.",
            "cut": "<Hazelnut Shell Cuts>\n Description: Linear cuts on the shell surface, appearing as straight or slightly curved lighter markings. These cuts disrupt the smooth, glossy texture, potentially exposing the nut to spoilage or insect damage, compromising shell integrity."
        },
        "screw": {
            "thread_top": "<Thread Top Defect>\n Description: Irregularities in the threading at the top of the screw, such as flattened or malformed sections, disrupt the uniform spiral pattern. These defects can hinder the screw's ability to engage and secure materials, indicating possible manufacturing or handling issues.",
            "scratch_head": "<Surface Scratch>\n Description: Visible linear scratches on the screw head surface, affecting the smooth finish and potentially impacting tool engagement during installation. Located in various positions, these scratches suggest handling damage or manufacturing flaws.",
            "scratch_neck": "<Scratch on Screw Neck>\n Description: Linear abrasions on the screw's neck, just below the head, typically lighter in color, indicating material removal. Positioned centrally, these scratches affect the aesthetic and may compromise the screw's structural integrity, especially under stress.",
            "thread_side": "<Thread Deformation>\n Description: Irregularities along the helical threads on the shaft, including interruptions or malformations, affecting the screw's ability to grip materials securely. These inconsistencies in thread spacing and depth impact performance and reliability.",
            "manipulated_front": "<Tip Deformation>\n Description: Deformation or blunting at the screw tip, resulting in an irregular shape that affects material penetration. This defect may appear as a crushed tip or altered contour, impacting initial engagement and holding power, often due to manufacturing or handling issues."
        },
        "carpet": {
            "thread": "<Thread Anomaly>\n Description: Loose, protruding, or stray threads in the woven fabric, often lighter in color, disrupt the uniform weave pattern. These irregular threads may be frayed or hanging loosely, impacting both aesthetic quality and structural integrity.",
            "metal_contamination": "<Metal Contamination>\n Description: Small metallic objects embedded within the fabric, contrasting with the weave pattern and matte texture. These shiny contaminants, found near the center or corners, affect both the appearance and functional integrity of the textile.",
            "hole": "<Fabric Hole>\n Description: Irregularly shaped gaps with frayed or loose threads in the fabric, often located centrally or at the sides, disrupt the uniform weave and compromise structural integrity, indicating potential damage or wear.",
            "color": "<Color Inconsistency>\n Description: Localized discoloration in the fabric, appearing as darker patches or spots that disrupt the gray or brown tones. These irregularly shaped areas suggest dye inconsistencies or contamination, impacting the visual uniformity.",
            "cut": "<Cut in Fabric>\n Description: Cuts or tears in the woven fabric, creating gaps with frayed, disarrayed threads. These distinct areas disrupt the uniform weave and compromise both the texture and structural integrity of the fabric."
        },
        "leather": {
            "fold": "<Fold Defect>\n Description: A raised, irregular line disrupting the uniform texture of the leather, often located centrally or to the right. These folds create shadows and contrast with the surrounding material, impacting the leather's aesthetic and structural integrity.",
            "poke": "<Puncture Defect>\n Description: Small punctures or dark spots in the leather, often located near the center, top, or bottom. These punctures disrupt the grain pattern, sometimes with frayed edges or lighter spots around them, affecting the material's integrity.",
            "glue": "<Adhesive Residue>\n Description: Irregular, glossy spots or deposits on the leather, contrasting with its matte finish. Often lighter or shiny, these areas indicate foreign substances like adhesive, positioned centrally or near the edges, disrupting the leather's uniform texture.",
            "color": "<Color Anomaly in Leather>\n Description: Distinct discoloration in reddish or bluish-gray hues, contrasting with the brown leather. Positioned variably across the leather, this superficial discoloration disrupts the material’s color consistency, indicating potential dye or contamination issues.",
            "cut": "<Leather Cut Defect>\n Description: Linear cuts or tears with jagged, frayed edges, often lighter than the surrounding leather, disrupting its continuity. These cuts, positioned centrally or to one side, reveal lighter fibers and impact both aesthetic and structural integrity."
        },
        "wood": {
            "combined": "<Wood Defects>\n Description: Wood surfaces exhibit multiple defects that disrupt grain patterns and color consistency. Common defects include:\n - **Knots**: Dark, rounded spots with irregular grain, denser texture than surrounding wood.\n - **Cracks**: Jagged breaks interrupting the grain, compromising structural integrity.\n - **Discolorations**: Irregular color spots (reddish or other stains) contrasting with natural tones.\n - **Scratches**: Lighter surface abrasions running parallel or across the grain.\n - **Holes**: Small round depressions, potentially from insects, disrupting uniformity.\n These defects impact both the aesthetic and structural quality of the wood.",
            "scratch": "<Wood Surface Scratches>\n Description: Scratches on wood, typically lighter in color, disrupt the grain pattern. Variations in length and orientation indicate mechanical abrasion, affecting aesthetic appeal and potentially compromising wood integrity over time.",
            "hole": "<Wood Surface Defects>\n Description: Holes and cracks interrupting wood grain, with holes appearing as dark circular voids and cracks as longitudinal breaks. These defects compromise structure, disrupting both appearance and functional quality of the wood.",
            "color": "<Color Anomalies>\n Description: Irregular discolorations manifest as spots or streaks in reddish, bluish-gray, or darker shades that contrast with natural wood tones. These color anomalies disrupt the visual consistency, indicating potential staining or manufacturing issues.",
            "liquid": "<Wood Liquid Stain>\n Description: Darker, irregular stains indicating liquid exposure, with blurred edges disrupting wood's uniform texture. Located towards the center or along grain patterns, these stains affect the wood's aesthetic appeal and consistency."
        },
        "bottle": {
            "contamination": "<Contamination>\n Description: Irregular anomalies within the bottle's opening, such as lighter patches, smudges, or cloudy areas that differ from the expected dark and smooth interior. Located near the center, these contaminants disrupt appearance, indicating potential quality control issues.",
            "broken_large": "<Broken Large>\n Description: Significant breakages or chips along the bottle rim, characterized by jagged, irregular edges that disrupt the circular contour. These large breaks compromise structural integrity and may present safety hazards, with missing material contrasting in color and texture against the intact rim.",
            "broken_small": "<Small Breakage or Chip>\n Description: Small chips or breakages on the bottle's rim, presenting as jagged edges with color and texture contrasts. Typically located at various points around the rim, these minor breaks disrupt the smooth outline, potentially affecting the bottle's structural integrity."
        }        
    },
    "VisA": {
        "macaroni1": {
            "bad": "<Color Spot Defects and Physical Anomalies>\n Description: Macaroni pasta pieces display defects involving color irregularities and physical damages.\n\n - **Color Variations**: Dark or discolored spots that contrast with the uniform pasta color, indicating contamination or manufacturing inconsistencies.\n\n - **Physical Anomalies**: Chips, cracks, or scratches that disrupt the smooth or ridged surfaces typical of macaroni, often presenting as jagged edges or thin lines.\n\n Common distinguishing features include:\n - Visibility of discolorations against the yellow pasta tones.\n - Irregular shapes or missing portions signaling damage.\n - Texture differences from scratches or cracks that contrast with the pasta's smooth appearance."
        },
        "cashew": {
            "bad": "<Defects in Cashew Nuts>\n Description: Cashew nuts display a range of surface imperfections affecting appearance and quality:\n\n 1. **Stuck Together**: Some cashews are adhered to each other, creating irregular shapes, often due to improper separation during processing.\n\n 2. **Corner or Edge Breakage**: Missing or chipped portions at the edges create irregular contours, suggesting mechanical damage from handling.\n\n 3. **Small Holes or Punctures**: Dark spots indicating holes, potentially from insect damage, are visible against the nut surface.\n\n 4. **Scratches**: Superficial scratches create lighter or roughened areas, disrupting the smooth texture.\n\n 5. **Discolored Spots**: Dark or burnt-like spots, likely from overheating during processing, indicate potential quality issues.\n\n These defects impact the aesthetics, safety, and quality of the cashew nuts, emphasizing the need for thorough inspection."
        },
        "candle": {
            "bad": "<Candle Defects>\n Description: Candle defects include physical damage, discoloration, foreign particles, and wax irregularities:\n\n - **Color Contrast**: Spots or marks (e.g., pink, red, black) contrasting with the white wax, indicating contamination or inconsistencies.\n\n - **Shape and Texture Irregularities**: Protrusions, missing chunks, or excess wax that disrupt the standard cylindrical shape and smooth texture.\n\n - **Physical Damage**: Chips or nicks on edges or surfaces detract from appearance and may impact burning performance.\n\n - **Foreign Particles**: Small specks on the wax surface inconsistent with the clean finish expected in quality candles.\n\n These characteristics indicate deviations from the expected 'normal' quality, highlighting potential issues in production."
        },
        "pipe_fryum": {
            "bad": "<Stuck or Fused Fryums>\n Description: Fryum pieces adhering together instead of being separate, disrupting the expected individual presentation. Fused areas show continuous texture, impacting visual appeal and portioning.\n\n <Surface Scratches>\n Description: Small, linear scratches on the fryum surface, appearing as fine, lighter lines that disrupt the uniform texture. These scratches suggest handling or production imperfections, detracting from quality.\n\n <Burnt or Discolored Spots>\n Description: Darker spots of discoloration on the fryum, indicating uneven cooking or excessive heat. These irregular spots affect the snack's appearance, taste, and consumer acceptability.\n\n <Breakage or Structural Damage>\n Description: Breakage or gaps disrupting the cylindrical shape, with cracks radiating from the damaged area. This defect affects aesthetics and may impact the fryum's functionality and edibility."
        },
        "macaroni2": {
            "bad": "<Macaroni Defects>\n Description: Macaroni pasta displays physical irregularities and discolorations:\n\n - **Chips or Cracks**: Small chips or cracks on edges, disrupting the smooth contour and indicating structural weakness.\n\n - **Surface Scratches**: Small scratches or abrasions create texture inconsistencies and affect finish.\n\n - **Discoloration**: Color spots on the surface, suggesting issues with manufacturing or raw material quality.\n\n These defects impact both the aesthetic appeal and cooking properties, affecting consumer perception and product quality."
        },
        "pcb3": {
            "bad": "<Melt or Heat Damage>\n Description: Areas on the PCB show discoloration, deformation, or melting, typically near solder joints or components. Reddish or darker patches and uneven texture indicate excessive heat exposure, compromising electrical connections and PCB functionality.\n\n <Scratch>\n Description: Linear abrasions on the PCB surface, often lighter in color, disrupt the solder mask smoothness. These scratches can run horizontally or diagonally and may affect functionality if they damage electrical pathways, indicating improper handling.\n\n <Missing Component>\n Description: A designated electronic component is absent from its intended location on the PCB, leaving visible solder pads. This absence may cause malfunctions, as each component is essential to circuit functionality.\n\n <Bent Component>\n Description: A component, such as a pin or LED, is visibly bent from its intended position, potentially impacting connectivity and functionality. This misalignment may affect both aesthetic and operational integrity, often due to handling errors."
        },
        "fryum": {
            "bad": "<Fryum Defects>\n Description: Fryums display color variations, surface scratches, fusion, and breakage defects:\n\n - **Color Spots**: Small, irregular darker spots indicating overcooking, ingredient variation, or contamination.\n\n - **Surface Scratches**: Fine scratches disrupting the uniform appearance, suggesting handling or manufacturing imperfections.\n\n - **Breakages**: Gaps or missing sections in spokes or central hub, compromising structural integrity and symmetry.\n\n - **Fusion**: Overlapping or adhered fryums, affecting appearance and functionality.\n\n These defects deviate from expected quality, highlighting areas needing quality control."
        },
        "pcb2": {
            "bad": "<Melt and Deformation>\n Description: PCB defects show signs of melting or thermal damage, appearing as discolored, deformed, or irregular areas where excessive heat exposure occurred. Key features include darkened patches, altered color, and irregular texture disrupting the board's uniformity. These anomalies can impact PCB functionality by damaging electrical connections or compromising component structure. Affected areas are often near pins, components, or solder pads, indicating overheating or manufacturing issues during soldering or usage."
        },
        "capsules": {
            "bad": "<Capsule Anomalies>\n Description: Capsules show defects including discoloration and bubbles or irregular shapes. Discoloration appears as reddish or orange hues contrasting with the uniform green, suggesting chemical reactions or manufacturing errors. Bubble-like irregularities or deformities disrupt the smooth surface, indicating compromised integrity during encapsulation. Defects vary from subtle color changes to distinct irregular shapes, highlighting quality control issues that require further inspection or removal from the batch."
        },
        "pcb1": {
            "bad": "<Melt and Deformation Anomaly>\n Description: PCB defects show localized melting or deformation from excessive heat or stress. These areas are discolored, irregular, and contrast with the smooth, uniformly colored surrounding PCB. The affected regions often appear rough, darkened, or visually distorted, indicating compromised material integrity. Located near critical components or connection points, these defects may impact the ultrasonic sensor module's functionality. Scratches on the damaged areas can further exacerbate issues, affecting electrical traces or solder pads and potentially leading to connectivity failures."
        },
        "chewinggum": {
            "bad": "<Material Missing and Surface Damage>\n Description: Defects include areas of missing material and surface imperfections, creating irregular, rough textures that disrupt the expected smoothness and uniformity. Missing material appears as chunks or indentations, often located centrally or near corners, with contrasting colors highlighting the disruption. Additional scratches or surface marks further compromise appearance and may suggest quality or durability concerns. These anomalies vary in size and shape, generally presenting as visible material loss or superficial markings that detract from the intended finish."
        },
        "pcb4": {
            "bad": "<Burnt Area>\n Description: Darker discoloration on the PCB surface, often near electronic components, indicating heat or electrical damage. This burnt area may show signs of scorching, compromising PCB functionality by disrupting electrical pathways or damaging components.\n\n <Missing Component>\n Description: Absence of an expected component on the PCB, with visible solder pads but no mounted element. These empty spaces disrupt circuitry, impacting board functionality and requiring attention during quality assessment.\n\n <Extra Material>\n Description: Unintended materials or residues on the PCB surface, such as blobs of solder or foreign substances, contrast with the board's clean appearance. These materials risk short circuits and indicate manufacturing quality control issues.\n\n <Surface Scratch>\n Description: Visible linear abrasions on the PCB surface, disrupting the solder mask. Scratches reveal underlying material, potentially impacting performance if they disrupt circuit pathways, and affecting the board’s aesthetic.\n\n <Dirt or Contamination>\n Description: Foreign substances or dirt on the PCB surface, appearing as spots or streaks, stand out against the board's clean finish. Contamination can interfere with electrical connections, pointing to quality control issues in manufacturing or handling.\n\n <Misaligned Component>\n Description: Components positioned incorrectly on the PCB, potentially leading to connectivity issues. Misaligned parts appear shifted from their designated pads, risking assembly problems and affecting product reliability and performance."
        }        
    }
}